Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གཏིང་དཔག་དཀའོ། །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་གཏིང་དཔག་དཀའ་བའི་ཕྱིར།
en: The perfection of wisdom is hard to fathom because all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment are hard to fathom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གཏིང་དཔག་དཀའོ། །འཕགས་པའི་བདེན་པ་དང་བསམ་གཏན་དང་ཚད་མེད་པ་དང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་།
en: The perfection of wisdom is hard to fathom because the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers are hard to fathom.

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་གཏིང་དཔག་དཀའ་བའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གཏིང་དཔག་དཀའོ། །ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་རྣམས་གཏིང་དཔག་དཀའ་བའི་ཕྱིར།
en: The perfection of wisdom is hard to fathom because the meditative stabilities and the dhāraṇī gateways are hard to fathom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གཏིང་དཔག་དཀའོ། །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་གཏིང་དཔག་དཀའ་བའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གཏིང་དཔག་དཀའོ།
en: The perfection of wisdom is hard to fathom because the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are hard to fathom.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་གཏིང་དཔག་དཀའ་བའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གཏིང་དཔག་དཀའོ།
en: The perfection of wisdom is hard to fathom because [the goals], up to and including all-aspect omniscience, are hard to fathom.” {

source: བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཚད་མ་མཆིས་པའོ།
en: IV: 14} “Blessed Lord, this perfection of wisdom is immeasurable.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་ཚད་མེད་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཚད་མེད་དོ།
en: Śāradvatīputra,” replied the Blessed One, “the perfection of wisdom is immeasurable because physical forms are immeasurable.

source: །ཤ་ར་དྭ་ཏིའི་བུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཚད་མེད་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཚད་མེད་དོ།
en: Śāradvatīputra, the perfection of wisdom is immeasurable because feelings, perceptions, formative predispositions, and consciousness are immeasurable.

source: །ཤ་ར་དྭ་ཏིའི་བུ་སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཚད་མེད་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཚད་མེད་དོ།
en: Śāradvatīputra, the perfection of wisdom is immeasurable because the sense fields, the sensory elements, and the links of dependent origination are immeasurable.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཚད་མེད་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཚད་མེད་དོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་།
en: The perfection of wisdom is immeasurable because all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment are immeasurable.

source: ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་ཚད་མེད་པའི་ཕྱིར།
en: The perfection of wisdom is immeasurable because the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers are immeasurable.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཚད་མེད་དོ། །ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་ཚད་མེད་པའི་ཕྱིར།
en: The perfection of wisdom is immeasurable because the meditative stabilities and the dhāraṇī gateways are immeasurable.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཚད་མེད་དོ། །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཚད་མེད་པའི་ཕྱིར།
en: The perfection of wisdom is immeasurable because the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are immeasurable.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཚད་མེད་དོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཚད་མེད་པའི་ཕྱིར།
en: The perfection of wisdom is immeasurable because [the goals], up to and including all-aspect omniscience, are immeasurable.” “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཚད་མེད་དོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ལགས།
en: Blessed Lord, how do bodhisattva great beings practice the perfection of wisdom?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གལ་ཏེ་གཟུགས་ཟབ་ཅེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: Śāradvatīputra,” replied the Blessed One, “when bodhisattva great beings practice the perfection of wisdom, if they do not engage with the notion that physical forms are profound, then they are practicing the perfection of wisdom.

source: །གལ་ཏེ་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ཟབ་ཅེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notion that feelings, perceptions, formative predispositions, and consciousness are profound, then they are practicing the perfection of wisdom.

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཟབ་ཅེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་།
en: If they do not engage with the notion that the sense fields, the sensory elements, and the links of dependent origination are profound, then they are practicing the perfection of wisdom.

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཐོབ་ཅེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་།
en: If they do not engage with the notion that all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment are profound, then they are practicing the perfection of wisdom.

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་ཟབ་ཅེས་བྱ་བར་མི་སྤྱོད་ན།
en: If they do not engage with the notion that the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers are profound, then they are practicing the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཟབ་ཅེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notion that the meditative stabilities and the dhāraṇī gateways are profound, then they are practicing the perfection of wisdom.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཟབ་ཅེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notion that the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are profound, then they are practicing the perfection of wisdom.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཟབ་ཅེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་བ།
en: If they do not engage with the notion that [the goals], up to and including all-aspect omniscience, are profound, then they are practicing the perfection of wisdom. “

source: བམ་པོ་བཞི་བཅུ་གཉིས་པ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་ཀྱི་ཟབ་པ་ཉིད་གང་ཡིན་པ་དེ་ནི། གཟུགས་མ་ཡིན་ནོ།
en: If you ask why, Śāradvatīputra, the profundity of physical forms is not physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་ཟབ་པ་ཉིད་གང་ཡིན་པ་དེ་ནི། རྣམ་པར་ཤེས་པ་མ་ཡིན་ནོ།
en: The profundity of feelings, perceptions, formative predispositions, and consciousness is not consciousness [and so forth].

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་ཟབ་པ་ཉིད་གང་ཡིན་པ་དེ་ནི། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་མ་ཡིན་ནོ། །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་།
en: The profundity of the sense fields, the sensory elements, and the links of dependent origination is not the links of dependent origination [and so forth].

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་གྱི་ཟབ་པ་ཉིད་གང་ཡིན་པ་དེ་ནི། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་མ་ཡིན་ནོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་།
en: The profundity of all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment is not the thirty-seven factors conducive to enlightenment [and so forth].

source: མངོན་པར་ཤེས་པ་རྣམས་ཀྱི་ཟབ་པ་ཉིད་གང་ཡིན་པ་དེ་ནི། མངོན་པར་ཤེས་པ་རྣམས་མ་ཡིན་ནོ། །ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱི་ཟབ་པ་ཉིད་གང་ཡིན་པ་དེ་ནི། གཟུངས་ཀྱི་སྒོ་རྣམས་མ་ཡིན་ནོ།
en: The profundity of the meditative stabilities and the dhāraṇī gateways is not the dhāraṇī gateways [and so forth].

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་ཟབ་པ་ཉིད་གང་ཡིན་པ་དེ་ནི། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་མ་ཡིན་ནོ།
en: The profundity of the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas is not the eighteen distinct qualities of the buddhas [and so forth].

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་ཟབ་པ་ཉིད་གང་ཡིན་པ་དེ་ནི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་ཡིན་ནོ།
en: The profundity of [the goals], up to and including all-aspect omniscience, is not all-aspect omniscience [and so forth]. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གལ་ཏེ་གཟུགས་གཏིང་དཔག་དཀའོ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, if they do not engage with the notion that physical forms are hard to fathom, then they are practicing the perfection of wisdom.

source: །གལ་ཏེ་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་གཏིང་དཔག་དཀའོ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notion that feelings, perceptions, formative predispositions, and consciousness are hard to fathom, then they are practicing the perfection of wisdom.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་གཏིང་དཔག་དཀའོ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notion that the sense fields, the sensory elements, and the links of dependent origination are hard to fathom, then they are practicing the perfection of wisdom.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་གཏིང་དཔག་དཀའོ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་།
en: If they do not engage with the notion that all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment are hard to fathom, then they are practicing the perfection of wisdom.

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་གཏིང་དཔའ་དཀའོ་ཞེས་བྱ་བར་མི་སྤྱོད་ན།
en: If they do not engage with the notion that the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers are hard to fathom, then they are practicing the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །ཏིང་ངེ་འཛིན་རྣམས་དང་གཟུངས་ཀྱི་སྒོ་རྣམ་གཏིང་དཔག་དཀའོ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notion that the meditative stabilities and the dhāraṇī gateways are hard to fathom, then they are practicing the perfection of wisdom.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་གཏིང་དཔག་དཀའོ་ཞེས་བྱ་བར་མི་སྦྱོར་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notion that the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are hard to fathom, then they are practicing the perfection of wisdom.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་གཏིང་དཔག་དཀའོ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notion that [the goals], up to and including all-aspect omniscience, are hard to fathom, then they are practicing the perfection of wisdom. “

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་ཀྱི་གཏིང་དཔག་དཀའ་བ་གང་ཡིན་པ་དེ་ནི། གཟུགས་མ་ཡིན་ནོ།
en: If you ask why, Śāradvatīputra, the unfathomability of physical forms is not physical forms.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་གཏིང་དཔག་དཀའ་བ་གང་ཡིན་པ་དེ་ནི། རྣམ་པར་ཤེས་པ་མ་ཡིན་ནོ།
en: The unfathomability of feelings, perceptions, formative predispositions, and consciousness is not consciousness [and so forth].

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་གཏིང་དཔག་དཀའ་བ་གང་ཡིན་པ་དེ་ནི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་ཡིན་ནོ།
en: The unfathomability of [the other phenomena, attributes, and goals], up to and including all-aspect omniscience, is not all-aspect omniscience [and so forth]. {

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གལ་ཏེ་གཟུགས་ཚད་མེད་དོ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: Ki.IV: 15} “Moreover, Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, if they do not engage with the notion that physical forms are immeasurable, then they are practicing the perfection of wisdom.

source: །གལ་ཏེ་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ཚད་མེད་དོ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notion that feelings, perceptions, formative predispositions, and consciousness are immeasurable, then they are practicing the perfection of wisdom.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཚད་མེད་དོ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notion that the sense fields, the sensory elements, and the links of dependent origination are immeasurable, then they are practicing the perfection of wisdom.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཚད་མེད་དོ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་།
en: If they do not engage with the notion that all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment are immeasurable, then they are practicing the perfection of wisdom.

source: གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་ཚད་མེད་དོ་ཞེས་བྱ་བར་མི་སྤྱོད་ན།
en: If they do not engage with the notion that the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers are immeasurable, then they are practicing the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །ཏིང་ངེ་འཛིན་རྣམས་དང་གཟུངས་ཀྱི་སྒོ་རྣམས་ཚད་མེད་དོ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notion that the meditative stabilities and the dhāraṇī gateways are immeasurable, then they are practicing the perfection of wisdom.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཚད་མེད་དོ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notion that the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are immeasurable, then they are practicing the perfection of wisdom.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཚད་མེད་དོ་ཞེས་བྱ་བར་མི་སྤྱོད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: If they do not engage with the notion that [the goals], up to and including all-aspect omniscience, are immeasurable, then they are practicing the perfection of wisdom. “

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་ཀྱི་ཚད་མེད་པ་གང་ཡིན་པ་དེ་ནི། གཟུགས་མ་ཡིན་ནོ།
en: If you ask why, Śāradvatīputra, the immeasurability of physical forms is not physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་། འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པའི་ཚད་མེད་པ་གང་ཡིན་པ་དེ་ནི། རྣམ་པར་ཤེས་པ་མ་ཡིན་ནོ།
en: The immeasurability of feelings, perceptions, formative predispositions, and consciousness is not consciousness [and so forth].

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཚད་མེད་པ་གང་ཡིན་པ་དེ་ནི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་ཡིན་ནོ།
en: The immeasurability of [the other phenomena, attributes, and goals], up to and including all-aspect omniscience, is not all-aspect omniscience [and so forth].”

source: ཀྱེ་མ་བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་དེ་ལྟར་ཟབ་པོ། །དེ་ལྟར་གཏིང་དཔག་དཀའོ། །དེ་ལྟར་རྟོགས་པར་དཀའོ།
en: Blessed Lord, this perfection of wisdom is so profound, so hard to fathom, and so hard to realize.

source: །བཅོམ་ལྡན་འདས་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་དེ་ལྟར་ཚད་མ་མཆིས་པའོ།
en: Blessed Lord, this perfection of wisdom is so immeasurable.

source: །བཅོམ་ལྡན་འདས་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་མདུན་དུ་བཤད་པར་མི་བགྱི་སྟེ།
en: Blessed Lord, this should not be explained in the presence of bodhisattva great beings who have newly entered the vehicle.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཐོས་ནས། འཇིགས་སྔང་ཤིང་སྐྲག་པར་འགྱུར་དུ་མཆིའོ།
en: Having heard this profound perfection of wisdom, they would be fearful, afraid, and terrified.

source: །ཐེ་ཚོམ་དང་ནེམ་ནུར་འཚལ་དུ་མཆིའོ།
en: They would be hesitant and doubtful.

source: །མོས་པ་མ་མཆིས་པར་འགྱུར་དུ་མཆིའོ།
en: They would be without devotion.

source: །བཅོམ་ལྡན་འདས་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་མདུན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་བསྟན་པར་བགྱི་སྟེ།
en: Blessed Lord, this profound perfection of wisdom should be revealed in the presence of bodhisattva great beings.

source: དེས་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཐོས་ནས་མི་འཇིགས་མི་སྔང་སྐྲག་པར་མི་འགྱུར་རོ།
en: Having heard this profound perfection of wisdom, they will not be fearful, afraid, or terrified.

source: ཐེ་ཚོམ་དང་ནེམ་ནུར་འཚལ་བར་མི་འགྱུར་ཏེ།
en: They will not be hesitant or doubtful.

source: ཐོས་ནས་ཀྱང་གོང་ནས་གོང་དུ་མོས་པ་དང་འཛིན་པ་དང་། འཆང་བ་དང་ཀློག་པ་དང་ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་པར་འགྱུར་རོ།
en: Having heard it, they would be increasingly devoted, and they would take up, uphold, recite, master, and focus their attention correctly on it.”

source: །དེ་ནས་ལྷའི་དཔང་པོ་བརྒྱ་བྱིན་གྱིས། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གལ་ཏེ་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་མདུན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་བཤད་ན་ཉེས་པ་ཅིར་འགྱུར། ཤ་ར་དྭ་ཏིའི་བུས་སྨྲས་པ།
en: Then Śakra, mighty lord of the gods, asked the venerable Śāradvatīputra, “Venerable Śāradvatīputra, if this profound perfection of wisdom is explained in the presence of bodhisattva great beings who have newly entered the vehicle, what fault would there be?” “

source: ཀཽ་ཤི་ཀ་གལ་ཏེ་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་མདུན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་བཤད་ན། དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཐོས་ནས། འཇིགས་པར་འགྱུར། སྔང་བར་འགྱུར། སྐྲག་པར་འགྱུར་ཏེ།
en: Kauśika,” replied Śāradvatīputra, “if this profound perfection of wisdom is explained in the presence of bodhisattva great beings who have newly entered the vehicle, having heard this profound perfection of wisdom, they would be fearful, afraid, and terrified.

source: ཕྱིར་ལྡོག་པར་འགྱུར་རོ།
en: They would turn away from it.

source: །སྦོད་བར་འགྱུར་རོ།
en: They would forsake it.

source: །དེ་ནི་མོས་པར་ཡང་མི་འགྱུར་ཏེ།
en: They would be without devotion.

source: ཀཽ་ཤི་ཀ་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཐོས་ནས། སྤངས་པའི་ཕྱིར་དེ་ལོག་པར་ལྟུང་བར་འགྱུར་བའི་ལས་མངོན་པར་འདུ་བྱེད་ཅིང་སོགས་པར་འགྱུར་ཏེ། ལས་བྱས་པ་དང་བསགས་པ་དེས་ཀྱང་།
en: Kauśika, having heard this perfection of wisdom, bodhisattva great beings who have newly entered the vehicle would actualize and accumulate the world-forming deeds that descend into erroneous [paths] because they would have rejected it.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ཡང་དཀའ་བ་དེ་ལྟ་བུའི་གནས་ཡོད་དོ།
en: It is difficult for those who have generated and accrued such world-forming deeds to attain consummate buddhahood in unsurpassed, complete enlightenment.

source: །བརྒྱ་བྱིན་གྱིས་སྨྲས་པ།
en: That is the situation!”

source: བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལུང་མ་བསྟན་པ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཐོས་ནས། མི་འཇིགས་མི་སྔང་སྐྲག་པར་མི་འགྱུར་བ་ལྟ་ཡོད་དམ། སྨྲས་པ།
en: Śakra then asked, “Venerable Śāradvatīputra, are there bodhisattva great beings, not yet prophesied, who, having heard this profound perfection of wisdom, will not be afraid, fearful, or terrified?” “

source: ཀཽ་ཤི་ཀ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཐོས་ནས་མི་འཇིགས་མི་སྔང་སྐྲག་པར་མི་འགྱུར་བ་དེ་དག་ནི་རིང་པོར་མི་ཐོགས་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་འགྱུར་ཏེ།
en: Kauśika, those bodhisattva great beings who will not be afraid, fearful, or terrified, having heard this profound perfection of wisdom, will be prophesied to attain unsurpassed, complete enlightenment before long. {Ki.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གཅིག་གམ། གཉིས་ལས་མི་འདའ་བར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་ལུང་བསྟན་པར་འགྱུར་རོ།
en: IV: 16} They will be prophesied to attain [all the goals], up to and including unsurpassed, complete enlightenment, before they have encountered more than one or two tathāgatas, arhats, completely awakened buddhas.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་དེ་དེ་བཞིན་ནོ།
en: Then the Blessed One said to the venerable Śāradvatīputra, “It is so, Śāradvatīputra!
